[
    {
        "title": "Logan (2017)",
        "videoLink": "https://www.youtube.com/watch?v=ebATJcTMvOk",
        "timestamp": "10m10s",
        "dyk": "There's a fresco painting from 1856 visible to this day in the rotunda of the capitol building of the United States of America called The Apotheosis of Washington. It literally portrays the moment that George Washington was deified and became a god. This exists right now, for real. Oh and did I mention he is surrounded by women, only women, worshiping and celebrating the deification of a man. 1856, you sexist though."
    },
    {
        "title": "Logan (2017)",
        "videoLink": "https://www.youtube.com/watch?v=ebATJcTMvOk",
        "timestamp": "11m41s",
        "dyk": "The funeral that Logan is at towards the beginning is at Greenwood Cemetery, itself quite famous in the comics and not really knowing what that meant, I went ahead and looked it up. It really only meant something to the film universe if you take the Ultimates continuity, but that is where Captain America, Steve Rogers, is buried. "
    },
    {
        "title": "Guardians of the Galaxy (2014)",
        "videoLink": "https://www.youtube.com/watch?v=gjwzCrtK5G0",
        "timestamp": "2m9s",
        "dyk": "Troma Entertainment *are we really doing this?* Troma Entertainment is an independent film company whose Wikipedia page contains the helpful phrase: \"Many Troma films contain social commentary.\" Cool."
    },
    {
        "title": "The Emperor's New Groove (2000)",
        "videoLink": "https://www.youtube.com/watch?v=rHB039JB5_E",
        "timestamp": "1m15s",
        "dyk": "Without question, many of you have seen the more-difficult-to-find-than-you-would-think and never officially released documentary: The Sweatbox, chronicling the troubled creation of this film, prominently featuring and increasingly-annoyed Sting, which seems exceptionally cruel considering his wife is the one who created the documentary."
    },
    {
        "title": "The Emperor's New Groove (2000)",
        "timestamp": "2m59s",
        "dyk": "Jomps Wobbin himself is one of the six, count 'em, SIX writers credited on *Atlantis*."
    },
    {
        "title": "Fave 5 of 2016",
        "videoLink": "https://www.youtube.com/watch?v=hN2B7GHffgI",
        "timestamp": "19m1s",
        "dyk": "Before Damien Chazelle went off to create Whiplash, he was hired to work with Josh Capbell and Matt Stuecken on their screenplay \"The Cellar.\" The Cellar by the way was 10 Cloverfield Lane, which he has a writing credit on and I imagine much of his input is still on display in that film."
    },
    {
        "title": "The Grand Budapest Hotel (2014)",
        "videoLink": "https://www.youtube.com/watch?v=LdMIkzzj3_g",
        "timestamp": "6m19s",
        "dyk": "Had to throw this in real quick because it was so bloody cool: Toni Revell Orie, who plays Zero - aka Mr. Mustafa the impeccable moustache-, is playing Flash Thompson in the upcoming *Spider-Man: Homecoming* film."
    },
    {
        "title": "The Dark Knight (2008)",
        "videoLink": "https://www.youtube.com/watch?v=hFTmCqq-rYc",
        "timestamp": "14m34s",
        "dyk": "This actually was a botched take. The second set of explosions didn't go off and Heath, brave ass motherfucker that he was, stayed in character, ad-libbed this glory and went on about his business. It's the greatest cinematic performance of all time, and I'm really asking my dudes, *What's better?*"
    },
    {
        "title": "Serenity (2005)",
        "videoLink": "https://www.youtube.com/watch?v=mHo78pqvgFs",
        "timestamp": "11m29s",
        "dyk": "Joss Whedon got the idea for Firefly while reading, what I think is one of the greatest war novels of all time, and an absolute favorite book of mine: The Killer Angels by Michael Shaara. A book I remember all the way back from PACE history class at Wilson Middle School for advanced students and also people like me.  The Killer Angels is a book recounting The Civil War and more-accurately, the Battle of Gettysburg. It was later made into a film, Gettysburg, featuring an absolutely blistering performance by Jeff Daniels as Colonel Joshua Lawrence Chamberlain, who has the coolest storyline because he and his men basically run out of ammo, fix bayonets and swing down a hill “like a door” and that’s how we won Gettysburg. Oh, I guess ‘we’ provides a terrible context there. That could also be said that’s how ‘we’ lost Gettysburg. But that’s kinda the point because Firefly is about the fight after the one we just lost against ourselves."
    },
    {
        "title": "Monster Factory",
        "videoLink": "https://www.youtube.com/watch?v=Gl1c8F2-WNY",
        "timestamp": "0m59s",
        "dyk": "Luke and Bo weren't even the main characters in Season 5... on a show where their name is the show.  They gave John Schneider and Tom Wolpat a year off so they could do... NASCAR, apparently?  They were replaced by Coy and Vance Duke."
    },
    {
        "title": "Galaxy Quest (1999)",
        "videoLink": "https://www.youtube.com/watch?v=BOVdNtK2lnE",
        "timestamp": "9m3s",
        "dyk": "In the original theatrical version, the film was shown in THREE aspect ratios, not the two seen on the home video release.  The full-frame television stuff is still there, but every scene that takes place on earth before Jason gets to space was in 1.77:1 (16x9)."
    },
    {
        "title": "Galaxy Quest (1999)",
        "videoLink": "https://www.youtube.com/watch?v=BOVdNtK2lnE",
        "timestamp": "12m41s",
        "dyk": "In the scene where Gwen is freaking out about the crushers in the hallway, she says \"Oh, screw that,\" and we move on.  But if you watch her mouth, you can tell she said something else and they got scared about droppin' and f-bomb in what is otherwise a pretty all-ages-appropriate film."
    },
    {
        "title": "The Iron Giant (1999)",
        "videoLink": "https://www.youtube.com/watch?v=RdlmaCOp9cU",
        "timestamp": "1m25s",
        "dyk": "The actor that plays Hogarth in the film is no-longer-child actor Eli Marienthal, but like all things that go up, they must come down.  Hard.  Because, um.  He played Stifler's little brother in the American Pie films.  So I guess Hogarth grows up and becomes a real d-hole but at least he was in Country Bears, looking like Guy Fieri's long lost troll doll.  So..  There's that."
    },
    {
        "title": "The Iron Giant (1999)",
        "videoLink": "https://www.youtube.com/watch?v=RdlmaCOp9cU",
        "timestamp": "3m17s",
        "dyk_type":"BONUS",
        "dyk": "It was so important to Brad Bird to get the mannerisms and the manic energy of a young boy on Starbucks crack right, that he did the rough pencil animation on this scene HIMSELF."
    },
    {
        "title": "The Iron Giant (1999)",
        "videoLink": "https://www.youtube.com/watch?v=RdlmaCOp9cU",
        "timestamp": "5m6s",
        "dyk_type":"SUPER-EXTENDED EXTRA BONUS",
        "dyk": "I was 17 when this film came out and I remember being quite infatuated with the, for lack of a better term here, special effects in the movie, though, they're hand drawn just like everything else. There's such a fluidity to them and that resonated with me. It left a very real impression on me how abstract shapes were animated to create such a sense of motion and life out of the events happening onscreen in the film."
    },
    {
        "title": "Big Trouble in Little China (1986)",
        "videoLink": "https://www.youtube.com/watch?v=oHS5gtzK320",
        "timestamp": "7m16s",
        "dyk": "The reality of this is actually quite fascinating because there are, in fact, Chinese citizens that are born with green eyes.  They reside mostly in a small village called Liqian, and some of them even have blonde hair, which is equally unheard of in China.  Only recently, through DNA testing, did they find that over 2/3's of their DNA has Roman Caucasian origins."
    },
    {
        "title": "Big Trouble in Little China (1986)",
        "videoLink": "https://www.youtube.com/watch?v=oHS5gtzK320",
        "timestamp": "8m46s",
        "dyk": "That one of those god-like minibosses was the basis for Mortal Kombat OG Raiden - *okay, hold the phone* -  Everyone knows that. You watch the movie once and you wonder how Midway didn't get like sued or nothing. I mean, it's not even subtle."
    },
    {
        "title": "Zodiac (2007) ",
        "videoLink": "https://www.youtube.com/watch?v=YHDYMW2UfTM",
        "timestamp": "3m13s",
        "dyk": "It wasn't until the 2009 Academy Awards that a digital fim won best cinematography with *Slumdog Millionaire*.  And I, I had this whole joke, where I was going to shame the list of films that were nominated in cinematography cause they didn't even nominate *Zodiac*, and I was like.. I'm gonna get them, but now that I look it up, I mean what. a. hell. of. a. list."
    },
    {
        "title": "Scott Pilgrim vs. the World",
        "videoLink": "https://www.youtube.com/watch?v=YezF4I1Wg94",
        "timestamp": "8m53s",
        "dyk": "Everyone's favorite drummer Kim Pine was the original Nightcrawler because she blinks only a single time in the entire film and it's right there."
    },
    {
        "title": "The Cabin in the Woods (2012)",
        "videoLink": "https://www.youtube.com/watch?v=DbKnWsnq2jk",
        "timestamp": "8m37s",
        "dyk": "In the scene where they go swimming from the docks, the only one not to go swimming is Marty, and this was because Fran Kranz is FUCKING RIPPED, and it didn't fit the movie because the stoner and Flynn have fucking Cheetoes."
    },
    {
        "title": "The Cabin in the Woods (2012)",
        "videoLink": "https://www.youtube.com/watch?v=DbKnWsnq2jk",
        "timestamp": "8m52s",
        "dyk": "The on-screen body count in this movie is 69."
    },
    {
        "title": "The Cabin in the Woods (2012)",
        "videoLink": "https://www.youtube.com/watch?v=DbKnWsnq2jk",
        "timestamp": "9m11s",
        "dyk": "When they first released the monsters from the elevators, there's actually a one-eyed one-horned flying purple people eater."
    },
    {
        "title": "Hugo (2011)",
        "videoLink": "https://www.youtube.com/watch?v=itRh_WTuxrQ",
        "timestamp": "6m32s",
        "dyk": "Part of the reason Méliès is retired, and died penniless and embarrassed, was because this film, his masterpiece, A Trip to the Moon needed to make money internationally to stay afloat; Upon the Edison Company receiving a print of the film, they just distributed it, they stole it and made a shit load of money off pirating the movie.  And that's no small thing, film piracy literally bankrupted the first true genius of cinema, I don't even have a joke here, that just sucks...  EDISON YOU FLAMING BAG OF DICKS!"
    },
    {
        "title": "Demolition Man (1993)",
        "videoLink": "https://www.youtube.com/watch?v=MJ7y0EqRVQQ",
        "timestamp": "5m15s",
        "dyk": "The three seashells wasn't really a thing anyone should try to figure out.  For those that need to catch up in the future, instead of toilet paper, next to the toilet are three seashells, which perplexes John Spartan in a comfortable and endearing way.  In multiple interviews, Stallone has said that the idea is that two of the seashells would be used \"Like chopsticks\" to pull human waste \"Out of the body\", while the third is then used for general cleanup.  Which, okay sure, but in actuality, and this is true, I'm gonna ruin this now...  One of the writers of the film, Daniel Waters, was writing a scene where Stallone had to go to the bathroom.  He called a screenwriting friend across town and explained the problem, his friend went into the bathroom and said the first thing that he saw, on the tank of his friends toilet, was a bag of seashells.  So that's the depth of the sce- it doesn't mean anything, I'm sorry, it's just Vanilla Ice all over again!  It's not a puzzle here, they never meant anything.  Also, what the fuck Stallone, chopsticks?  Why would you use chopsticks to pull poop out of yourself?  That's weird, and it's not okay."
    },
    {
        "title": "Demolition Man (1993)",
        "videoLink": "https://www.youtube.com/watch?v=MJ7y0EqRVQQ",
        "timestamp": "7m59s",
        "dyk": "In pretty much every international territory, the restaurant was changed to Pizza Hut, and even dubbed over.  Lucky for us, some of the European versions ended up on American TV just to confuse people in the 90's that were expecting to see GODDAMN TACO BELL.  Get outta here Pizza Hut, nobody loves you."
    },
    {
        "title": "A.I. Artificial Intelligence (2001)",
        "videoLink": "https://www.youtube.com/watch?v=o5rTHfnWPig",
        "timestamp": "9m3s",
        "dyk": "This movie was originally going to be called simply \"A.I.\", but surveys revealed that people thought it said \"A1\".  The people they surveyed thought the title of this movie was the steak sauce, like multiple said that. <:muffled_catawampus:324667574912548874>"
    },
    {
        "title": "A.I. Artificial Intelligence (2001)",
        "videoLink": "https://www.youtube.com/watch?v=o5rTHfnWPig",
        "timestamp": "9m56s",
        "dyk": "The Robin Williams cameo is one of the most widely criticized Spielbergy things in the entire movie, and I'm about to blow your fucking mind.  Not only was Robin Williams playing this character Stanley Kubrick's idea, he actually directed and recorded it himself before his death.  Spielberg barely touched that scene."
    },
    {
        "title": "Road to Perdition (2002)",
        "videoLink": "https://www.youtube.com/watch?v=PBusbfbpw58",
        "timestamp": "7m59s",
        "dyk": "In the parts of the film leading up to Michael Jr witnessing the events and murder in the warehouse, to properly showcase the rift between father and son, they are filmed in divided parts of the frame, through windows, doors, etc.  They truly only become father and son when Michael Jr is dragged into the mob world, that's dark even by this movie's standards.  And once Michael Sr has completed his task, and killed damn near everyone that needed to be killed, again through murder, they are again separated by the framing of the door; only this time, Tom Hanks is able to walk through it."
    },
    {
        "title": "Road to Perdition (2002)",
        "videoLink": "https://www.youtube.com/watch?v=PBusbfbpw58",
        "timestamp": "8m43s",
        "dyk": "Actually, you almost certainly did know this one, but Perdition was the last film that Paul Newman acted in, and he is- well, I mean it's Paul Newman, he's incredible and absolutely commands every second of screen time he's in.  But at one point, the cinematographer, Conrad L Hall, when looking through the viewfinder at Paul Newman, he broke down in tears saying \"He was so beautiful\"."
    },
    {
        "title": "Road to Perdition (2002)",
        "videoLink": "https://www.youtube.com/watch?v=PBusbfbpw58",
        "timestamp": "9m17s",
        "dyk": "To acheive the look of 1931 during the great depression, the filmmakers called in pretty much every favor they had to pack every frame of this movie with so much life and movement, and it's all period appropriate.  To acheive this single shot of the Sullivan Wonder Twins driving into Chicago, they actually shut down the main thoroughfare on a quiet Sunday morning, and they filmed 120 actual period-appropriate cars.  I don't think any studio would even attempt that nowadays."
    },
    {
        "title": "Road to Perdition (2002)",
        "videoLink": "https://www.youtube.com/watch?v=PBusbfbpw58",
        "timestamp": "9m43s",
        "dyk": "Sam Mendez, and Conrad L Hall wanted the look of the film to mimic that of artist Edward Hopper, who most notably created the iconic painting \"Nighthawks\".  But you can see the influence on the movie in many of his other works, especially the way he uses light to paint a picture of midwest America during the time period."
    },
    {
        "title": "The Fifth Element v A Good Day to Die Hard",
        "videoLink": "https://www.youtube.com/watch?v=omXcqEJYA58",
        "timestamp": "4m55s",
        "dyk": "The hero Korben Dallas, and the villain Jean-Baptiste, never meet or speak a word to each other.  In fact, they're not even aware of each other, throughout the entire ordeal, they just happen to kinda try to foil each other without really knowing what's going on."
    },
    {
        "title": "The Fifth Element v A Good Day to Die Hard",
        "videoLink": "https://www.youtube.com/watch?v=omXcqEJYA58",
        "timestamp": "5m10s",
        "dyk": "Circles in this movie are a symbol of control.  Gary Oldman is almost constantly seen standing in front of them.  The police have them on their chests, the alien race are clearly encased in circular power armor, when people in the world are being subdued, they place their hands in the circles on the wall.  But the reality of circles are for people who think they're in control.  Remember that dude from the beginning?  Yeah, circle circle circle, his shit was all circles.  But the people in control are rectagles, Korbin Dallas is really all about rectangles, almost like Dallas... Is a laaannnd... Of Rectaangllllllles and drunks."
    },
    {
        "title": "The Fifth Element v A Good Day to Die Hard",
        "videoLink": "https://www.youtube.com/watch?v=omXcqEJYA58",
        "timestamp": "5m49s",
        "dyk": "The license plates on the cars are from future New York, and they say \"New York: The 'Fuck you' state\"."
    },
    {
        "title": "The Fifth Element v A Good Day to Die Hard",
        "videoLink": "https://www.youtube.com/watch?v=omXcqEJYA58",
        "timestamp": "6m34s",
        "dyk": "Okay, so he doesn't really have a middle name, and in the original Die Hard, the character of John McClane was based on Roderick Thorp's detective novel, Nothing Lasts Forever, and the character Joe Leeland.  So I made this his middle name, so just consider it part of the Die Hard cannon now, 'cause it's like a shout out, or a... Buzz chat... Or a... Feet gortch... Did I say \"gortch\"?"
    },
    {
        "title": "Ninja Turtles II (1991)",
        "videoLink": "https://www.youtube.com/watch?v=h4gqvCSnntY",
        "timestamp": "5m15s",
        "dyk": "BOOM Ernie Reyes Jr. fun fact y'all, in this movie he always played annoying as hell Keno Weasley. But did you know he was also in the first movie? Ernie Reyes Jr. was the guy in the Donatello suit voiced by Corey Feldman."
    }
]
